Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_lpcomp.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     nrf5340_application_lpcomp equates.
 */

#pragma once

#include    <stdint.h>

// LPCOMP address definitions
// --------------------------

typedef struct {
    volatile    uint32_t    TASKS_START;
    volatile    uint32_t    TASKS_STOP;
    volatile    uint32_t    TASKS_SAMPLE;
    volatile    uint32_t    RESERVED0[29];
    volatile    uint32_t    SUBSCRIBE_START;
    volatile    uint32_t    SUBSCRIBE_STOP;
    volatile    uint32_t    SUBSCRIBE_SAMPLE;
    volatile    uint32_t    RESERVED1[29];
    volatile    uint32_t    EVENTS_READY;
    volatile    uint32_t    EVENTS_DOWN;
    volatile    uint32_t    EVENTS_UP;
    volatile    uint32_t    EVENTS_CROSS;
    volatile    uint32_t    RESERVED2[28];
    volatile    uint32_t    PUBLISH_READY;
    volatile    uint32_t    PUBLISH_DOWN;
    volatile    uint32_t    PUBLISH_UP;
    volatile    uint32_t    PUBLISH_CROSS;
    volatile    uint32_t    RESERVED3[28];
    volatile    uint32_t    SHORTS;
    volatile    uint32_t    RESERVED4[64];
    volatile    uint32_t    INTENSET;
    volatile    uint32_t    INTENCLR;
    volatile    uint32_t    RESERVED5[61];
    volatile    uint32_t    RESULT;
    volatile    uint32_t    RESERVED6[63];
    volatile    uint32_t    ENABLE;
    volatile    uint32_t    PSEL;
    volatile    uint32_t    REFSEL;
    volatile    uint32_t    EXTREFSEL;
    volatile    uint32_t    RESERVED7[4];
    volatile    uint32_t    ANADETECT;
    volatile    uint32_t    RESERVED8[5];
    volatile    uint32_t    HYST;
} LPCOMP_TypeDef;

#ifdef __cplusplus
#define LPCOMP_NS   reinterpret_cast<LPCOMP_TypeDef *>(0x4001A000U)
#define LPCOMP_S    reinterpret_cast<LPCOMP_TypeDef *>(0x5001A000U)

#else
#define LPCOMP_NS   ((LPCOMP_TypeDef *)0x4001A000U)
#define LPCOMP_S    ((LPCOMP_TypeDef *)0x5001A000U)
#endif

// TASKS_START Configuration

#define LPCOMP_TASKS_START_TASKS_START                  (0x1U<<0U)
#define LPCOMP_TASKS_START_TASKS_START_TRIGGER          (0x1U<<0U)

// TASKS_STOP Configuration

#define LPCOMP_TASKS_STOP_TASKS_STOP                    (0x1U<<0U)
#define LPCOMP_TASKS_STOP_TASKS_STOP_TRIGGER            (0x1U<<0U)

// TASKS_SAMPLE Configuration

#define LPCOMP_TASKS_SAMPLE_TASKS_SAMPLE                (0x1U<<0U)
#define LPCOMP_TASKS_SAMPLE_TASKS_SAMPLE_TRIGGER        (0x1U<<0U)

// SUBSCRIBE_START Configuration

#define LPCOMP_SUBSCRIBE_START_EN                       (0x1U<<31U)
#define LPCOMP_SUBSCRIBE_START_CHIDX                    (0xFFU<<0U)
#define LPCOMP_SUBSCRIBE_START_CHIDX_0                  (0x1U<<0U)
#define LPCOMP_SUBSCRIBE_START_EN_DISABLED              (0x0U<<31U)
#define LPCOMP_SUBSCRIBE_START_EN_ENABLED               (0x1U<<31U)

// SUBSCRIBE_STOP Configuration

#define LPCOMP_SUBSCRIBE_STOP_EN                        (0x1U<<31U)
#define LPCOMP_SUBSCRIBE_STOP_CHIDX                     (0xFFU<<0U)
#define LPCOMP_SUBSCRIBE_STOP_CHIDX_0                   (0x1U<<0U)
#define LPCOMP_SUBSCRIBE_STOP_EN_DISABLED               (0x0U<<31U)
#define LPCOMP_SUBSCRIBE_STOP_EN_ENABLED                (0x1U<<31U)

// SUBSCRIBE_SAMPLE Configuration

#define LPCOMP_SUBSCRIBE_SAMPLE_EN                      (0x1U<<31U)
#define LPCOMP_SUBSCRIBE_SAMPLE_CHIDX                   (0xFFU<<0U)
#define LPCOMP_SUBSCRIBE_SAMPLE_CHIDX_0                 (0x1U<<0U)
#define LPCOMP_SUBSCRIBE_SAMPLE_EN_DISABLED             (0x0U<<31U)
#define LPCOMP_SUBSCRIBE_SAMPLE_EN_ENABLED              (0x1U<<31U)

// EVENTS_READY Configuration

#define LPCOMP_EVENTS_READY_EVENTS_READY                (0x1U<<0U)
#define LPCOMP_EVENTS_READY_EVENTS_READY_NOTGENERATED   (0x0U<<0U)
#define LPCOMP_EVENTS_READY_EVENTS_READY_GENERATED      (0x1U<<0U)

// EVENTS_DOWN Configuration

#define LPCOMP_EVENTS_DOWN_EVENTS_DOWN                  (0x1U<<0U)
#define LPCOMP_EVENTS_DOWN_EVENTS_DOWN_NOTGENERATED     (0x0U<<0U)
#define LPCOMP_EVENTS_DOWN_EVENTS_DOWN_GENERATED        (0x1U<<0U)

// EVENTS_UP Configuration

#define LPCOMP_EVENTS_UP_EVENTS_UP                      (0x1U<<0U)
#define LPCOMP_EVENTS_UP_EVENTS_UP_NOTGENERATED         (0x0U<<0U)
#define LPCOMP_EVENTS_UP_EVENTS_UP_GENERATED            (0x1U<<0U)

// EVENTS_CROSS Configuration

#define LPCOMP_EVENTS_CROSS_EVENTS_CROSS                (0x1U<<0U)
#define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_NOTGENERATED   (0x0U<<0U)
#define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_GENERATED      (0x1U<<0U)

// PUBLISH_READY Configuration

#define LPCOMP_PUBLISH_READY_EN                         (0x1U<<31U)
#define LPCOMP_PUBLISH_READY_CHIDX                      (0xFFU<<0U)
#define LPCOMP_PUBLISH_READY_CHIDX_0                    (0x1U<<0U)
#define LPCOMP_PUBLISH_READY_EN_DISABLED                (0x0U<<31U)
#define LPCOMP_PUBLISH_READY_EN_ENABLED                 (0x1U<<31U)

// PUBLISH_DOWN Configuration

#define LPCOMP_PUBLISH_DOWN_EN                          (0x1U<<31U)
#define LPCOMP_PUBLISH_DOWN_CHIDX                       (0xFFU<<0U)
#define LPCOMP_PUBLISH_DOWN_CHIDX_0                     (0x1U<<0U)
#define LPCOMP_PUBLISH_DOWN_EN_DISABLED                 (0x0U<<31U)
#define LPCOMP_PUBLISH_DOWN_EN_ENABLED                  (0x1U<<31U)

// PUBLISH_UP Configuration

#define LPCOMP_PUBLISH_UP_EN                            (0x1U<<31U)
#define LPCOMP_PUBLISH_UP_CHIDX                         (0xFFU<<0U)
#define LPCOMP_PUBLISH_UP_CHIDX_0                       (0x1U<<0U)
#define LPCOMP_PUBLISH_UP_EN_DISABLED                   (0x0U<<31U)
#define LPCOMP_PUBLISH_UP_EN_ENABLED                    (0x1U<<31U)

// PUBLISH_CROSS Configuration

#define LPCOMP_PUBLISH_CROSS_EN                         (0x1U<<31U)
#define LPCOMP_PUBLISH_CROSS_CHIDX                      (0xFFU<<0U)
#define LPCOMP_PUBLISH_CROSS_CHIDX_0                    (0x1U<<0U)
#define LPCOMP_PUBLISH_CROSS_EN_DISABLED                (0x0U<<31U)
#define LPCOMP_PUBLISH_CROSS_EN_ENABLED                 (0x1U<<31U)

// SHORTS Configuration

#define LPCOMP_SHORTS_CROSS_STOP                        (0x1U<<4U)
#define LPCOMP_SHORTS_UP_STOP                           (0x1U<<3U)
#define LPCOMP_SHORTS_DOWN_STOP                         (0x1U<<2U)
#define LPCOMP_SHORTS_READY_STOP                        (0x1U<<1U)
#define LPCOMP_SHORTS_READY_SAMPLE                      (0x1U<<0U)
#define LPCOMP_SHORTS_CROSS_STOP_DISABLED               (0x0U<<4U)
#define LPCOMP_SHORTS_CROSS_STOP_ENABLED                (0x1U<<4U)
#define LPCOMP_SHORTS_UP_STOP_DISABLED                  (0x0U<<3U)
#define LPCOMP_SHORTS_UP_STOP_ENABLED                   (0x1U<<3U)
#define LPCOMP_SHORTS_DOWN_STOP_DISABLED                (0x0U<<2U)
#define LPCOMP_SHORTS_DOWN_STOP_ENABLED                 (0x1U<<2U)
#define LPCOMP_SHORTS_READY_STOP_DISABLED               (0x0U<<1U)
#define LPCOMP_SHORTS_READY_STOP_ENABLED                (0x1U<<1U)
#define LPCOMP_SHORTS_READY_SAMPLE_DISABLED             (0x0U<<0U)
#define LPCOMP_SHORTS_READY_SAMPLE_ENABLED              (0x1U<<0U)

// INTENSET Configuration

#define LPCOMP_INTENSET_CROSS                           (0x1U<<3U)
#define LPCOMP_INTENSET_UP                              (0x1U<<2U)
#define LPCOMP_INTENSET_DOWN                            (0x1U<<1U)
#define LPCOMP_INTENSET_READY                           (0x1U<<0U)
#define LPCOMP_INTENSET_CROSS_DISABLED                  (0x0U<<3U)
#define LPCOMP_INTENSET_CROSS_ENABLED                   (0x1U<<3U)
#define LPCOMP_INTENSET_CROSS_SET                       (0x1U<<3U)
#define LPCOMP_INTENSET_UP_DISABLED                     (0x0U<<2U)
#define LPCOMP_INTENSET_UP_ENABLED                      (0x1U<<2U)
#define LPCOMP_INTENSET_UP_SET                          (0x1U<<2U)
#define LPCOMP_INTENSET_DOWN_DISABLED                   (0x0U<<1U)
#define LPCOMP_INTENSET_DOWN_ENABLED                    (0x1U<<1U)
#define LPCOMP_INTENSET_DOWN_SET                        (0x1U<<1U)
#define LPCOMP_INTENSET_READY_DISABLED                  (0x0U<<0U)
#define LPCOMP_INTENSET_READY_ENABLED                   (0x1U<<0U)
#define LPCOMP_INTENSET_READY_SET                       (0x1U<<0U)

// INTENCLR Configuration

#define LPCOMP_INTENCLR_CROSS                           (0x1U<<3U)
#define LPCOMP_INTENCLR_UP                              (0x1U<<2U)
#define LPCOMP_INTENCLR_DOWN                            (0x1U<<1U)
#define LPCOMP_INTENCLR_READY                           (0x1U<<0U)
#define LPCOMP_INTENCLR_CROSS_DISABLED                  (0x0U<<3U)
#define LPCOMP_INTENCLR_CROSS_ENABLED                   (0x1U<<3U)
#define LPCOMP_INTENCLR_CROSS_CLEAR                     (0x1U<<3U)
#define LPCOMP_INTENCLR_UP_DISABLED                     (0x0U<<2U)
#define LPCOMP_INTENCLR_UP_ENABLED                      (0x1U<<2U)
#define LPCOMP_INTENCLR_UP_CLEAR                        (0x1U<<2U)
#define LPCOMP_INTENCLR_DOWN_DISABLED                   (0x0U<<1U)
#define LPCOMP_INTENCLR_DOWN_ENABLED                    (0x1U<<1U)
#define LPCOMP_INTENCLR_DOWN_CLEAR                      (0x1U<<1U)
#define LPCOMP_INTENCLR_READY_DISABLED                  (0x0U<<0U)
#define LPCOMP_INTENCLR_READY_ENABLED                   (0x1U<<0U)
#define LPCOMP_INTENCLR_READY_CLEAR                     (0x1U<<0U)

// RESULT Configuration

#define LPCOMP_RESULT_RESULT                            (0x1U<<0U)
#define LPCOMP_RESULT_RESULT_BELOW                      (0x0U<<0U)
#define LPCOMP_RESULT_RESULT_ABOVE                      (0x1U<<0U)

// ENABLE Configuration

#define LPCOMP_ENABLE_ENABLE                            (0x3U<<0U)
#define LPCOMP_ENABLE_ENABLE_0                          (0x1U<<0U)
#define LPCOMP_ENABLE_ENABLE_DISABLED                   (0x0U<<0U)
#define LPCOMP_ENABLE_ENABLE_ENABLED                    (0x1U<<0U)

// PSEL Configuration

#define LPCOMP_PSEL_PSEL                                (0x7U<<0U)
#define LPCOMP_PSEL_PSEL_0                              (0x1U<<0U)
#define LPCOMP_PSEL_PSEL_ANALOGINPUT0                   (0x0U<<0U)
#define LPCOMP_PSEL_PSEL_ANALOGINPUT1                   (0x1U<<0U)
#define LPCOMP_PSEL_PSEL_ANALOGINPUT2                   (0x2U<<0U)
#define LPCOMP_PSEL_PSEL_ANALOGINPUT3                   (0x3U<<0U)
#define LPCOMP_PSEL_PSEL_ANALOGINPUT4                   (0x4U<<0U)
#define LPCOMP_PSEL_PSEL_ANALOGINPUT5                   (0x5U<<0U)
#define LPCOMP_PSEL_PSEL_ANALOGINPUT6                   (0x6U<<0U)
#define LPCOMP_PSEL_PSEL_ANALOGINPUT7                   (0x7U<<0U)

// REFSEL Configuration

#define LPCOMP_REFSEL_REFSEL                            (0xFU<<0U)
#define LPCOMP_REFSEL_REFSEL_0                          (0x1U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF1_8VDD                  (0x0U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF2_8VDD                  (0x1U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF3_8VDD                  (0x2U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF4_8VDD                  (0x3U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF5_8VDD                  (0x4U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF6_8VDD                  (0x5U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF7_8VDD                  (0x6U<<0U)
#define LPCOMP_REFSEL_REFSEL_AREF                       (0x7U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF1_16VDD                 (0x8U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF3_16VDD                 (0x9U<<0U)
#define LPCOMP_REFSEL_REFSEL_REF5_16VDD                 (0xAU<<0U)
#define LPCOMP_REFSEL_REFSEL_REF7_16VDD                 (0xBU<<0U)
#define LPCOMP_REFSEL_REFSEL_REF9_16VDD                 (0xCU<<0U)
#define LPCOMP_REFSEL_REFSEL_REF11_16VDD                (0xDU<<0U)
#define LPCOMP_REFSEL_REFSEL_REF13_16VDD                (0xEU<<0U)
#define LPCOMP_REFSEL_REFSEL_REF15_16VDD                (0xFU<<0U)

// EXTREFSEL Configuration

#define LPCOMP_EXTREFSEL_EXTREFSEL                      (0x1U<<0U)
#define LPCOMP_EXTREFSEL_EXTREFSEL_ANALOGREFERENCE0     (0x0U<<0U)
#define LPCOMP_EXTREFSEL_EXTREFSEL_ANALOGREFERENCE1     (0x1U<<0U)

// ANADETECT Configuration

#define LPCOMP_ANADETECT_ANADETECT                      (0x3U<<0U)
#define LPCOMP_ANADETECT_ANADETECT_0                    (0x1U<<0U)
#define LPCOMP_ANADETECT_ANADETECT_CROSS                (0x0U<<0U)
#define LPCOMP_ANADETECT_ANADETECT_UP                   (0x1U<<0U)
#define LPCOMP_ANADETECT_ANADETECT_DOWN                 (0x2U<<0U)

// HYST Configuration

#define LPCOMP_HYST_HYST                                (0x1U<<0U)
#define LPCOMP_HYST_HYST_DISABLED                       (0x0U<<0U)
#define LPCOMP_HYST_HYST_ENABLED                        (0x1U<<0U)
